Ran Plan for project: `sg` dir: `examples/sg` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.ex-1 must be replaced
-/+ resource "aws_security_group" "ex-1" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:182024812696:security-group/sg-022963fdf62074d25" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-022963fdf62074d25" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "ex-1" -> "ex-10" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "182024812696" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.ex-2 must be replaced
-/+ resource "aws_security_group" "ex-2" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:182024812696:security-group/sg-0fe15cb27714d46d5" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0fe15cb27714d46d5" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "ex-2" -> "ex-11" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "182024812696" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.ex-3 must be replaced
-/+ resource "aws_security_group" "ex-3" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:182024812696:security-group/sg-00c95cdb02f48d813" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-00c95cdb02f48d813" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "ex-3" -> "ex-12" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "182024812696" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.ex-4 must be replaced
-/+ resource "aws_security_group" "ex-4" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:182024812696:security-group/sg-059b41ac17539333f" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-059b41ac17539333f" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "ex-4" -> "ex-13" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "182024812696" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sg
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.dev.leedonggyu.com/lock?id=zkfmapf123%252Fatlantis-fargate%252Fexamples%252Fsg%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sg
  ```
Plan: 4 to add, 0 to change, 4 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```